#Напишите программу, которая считывает со стандартного ввода целые числа, по одному числу в строке,
и после первого введенного нуля выводит сумму полученных на вход чисел.


a = int(input())


while a != 0:
    a = int(input())
    a = a + 0
print(a)

 
